takurx/nRF5_test_ble_app_nus_and_hts_and_hrs_with_saadc_twi-bh1792glc/examples/ble_peripheral/ble_app_uart/main.c
    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);

    // Initialize NUS.
    memset(&nus_init, 0, sizeof(nus_init));

    nus_init.data_handler = nus_data_handler;

    err_code = ble_nus_init(&m_nus, &nus_init);
    APP_ERROR_CHECK(err_code);

    // Initialize Health Thermometer Service
    memset(&hts_init, 0, sizeof(hts_init));

    hts_init.evt_handler                 = on_hts_evt;
    //hts_init.evt_handler                 = NULL;
    hts_init.temp_type_as_characteristic = TEMP_TYPE_AS_CHARACTERISTIC;
    hts_init.temp_type                   = BLE_HTS_TEMP_TYPE_BODY;

    // Here the sec level for the Health Thermometer Service can be changed/increased.
    //hts_init.ht_meas_cccd_wr_sec = SEC_JUST_WORKS;
    hts_init.ht_meas_cccd_wr_sec = SEC_OPEN;
    hts_init.ht_type_rd_sec      = SEC_OPEN;

    err_code = ble_hts_init(&m_hts, &hts_init);
    APP_ERROR_CHECK(err_code);

    // Initialize Heart Rate Service.
    body_sensor_location = BLE_HRS_BODY_SENSOR_LOCATION_FINGER;

    memset(&hrs_init, 0, sizeof(hrs_init));

    hrs_init.evt_handler                 = NULL;
    hrs_init.is_sensor_contact_supported = true;
    hrs_init.p_body_sensor_location      = &body_sensor_location;

    // Here the sec level for the Heart Rate Service can be changed/increased.
    hrs_init.hrm_cccd_wr_sec = SEC_OPEN;
    hrs_init.bsl_rd_sec      = SEC_OPEN;

    err_code = ble_hrs_init(&m_hrs, &hrs_init);
    APP_ERROR_CHECK(err_code);

    // Initialize Battery Service.
    memset(&bas_init, 0, sizeof(bas_init));

    // Here the sec level for the Battery Service can be changed/increased.
    bas_init.bl_rd_sec        = SEC_OPEN;
    bas_init.bl_cccd_wr_sec   = SEC_OPEN;
    bas_init.bl_report_rd_sec = SEC_OPEN;

    bas_init.evt_handler          = NULL;
    bas_init.support_notification = true;
    bas_init.p_report_ref         = NULL;
    bas_init.initial_batt_level   = 100;

    err_code = ble_bas_init(&m_bas, &bas_init);
    APP_ERROR_CHECK(err_code);

    // Initialize Device Information Service.
    memset(&dis_init, 0, sizeof(dis_init));

    ble_srv_ascii_to_utf8(&dis_init.manufact_name_str, MANUFACTURER_NAME);
    //ble_srv_ascii_to_utf8(&dis_init.model_num_str, MODEL_NUM);

    //sys_id.manufacturer_id            = MANUFACTURER_ID;
    //sys_id.organizationally_unique_id = ORG_UNIQUE_ID;
    //dis_init.p_sys_id                 = &sys_id;

    dis_init.dis_char_rd_sec = SEC_OPEN;

    err_code = ble_dis_init(&dis_init);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

uint16_t Number_of_command = 40;
static const char * NusCommand[] = 
{
    "sta",    /* 0: start measurement command */
    "sto",    /* 1: stop measurement command  */
    "rqs",    /* 2: request series command    */
    "rqd",    /* 3: request data command      */
    "scd",    /* 4: set current days command  Ex. "scd 2018-12-25" */
    "sct",    /* 5: set current time command  Ex. "sct 12:20:15"   */
    "", "", "", "",     /* 6-9 */
    "", "", "", "", "", "", "", "", "", "",     /* 10-19 */
    "", "", "", "", "", "", "", "", "", "",     /* 20-29 */
    "dhr",    /* 30: debug output heart rate command     */
    "dbt",    /* 31: debug output temperature command    */
    "dsp",    /* 32: debug output stop command           */
    "dct",    /* 33: debut output current time */
    "", "", "", "", "", "",     /* 34-39 */
};

/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{

    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        uint32_t err_code;
        static char com_buf[128] = "";
        uint16_t i;
        uint16_t j;
        uint16_t buf_ind;
        int ind;

        char restime[] =    "2018-12-25T12:20:15";
        char resdatanum[] = "100";
        char respulse[] =   "100";
        char restemp[] =    "36.00,36.01,36.02,36.03,36.04,36.05";
        char resdata[128] = "";

        for (i = 0; i < p_evt->params.rx_data.length; i++)
        {
            do
            {
                err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);
                if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
                {
                    NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
                    APP_ERROR_CHECK(err_code);
                }
                //NRF_LOG_INFO("string: %c, %d", p_evt->params.rx_data.p_data[i], i);
                com_buf[i] = p_evt->params.rx_data.p_data[i];
            } while (err_code == NRF_ERROR_BUSY);
        }
        if (p_evt->params.rx_data.p_data[p_evt->params.rx_data.length - 1] == '\r')
        {
            while (app_uart_put('\n') == NRF_ERROR_BUSY);
        }

        com_buf[p_evt->params.rx_data.length] = '\0';
        //NRF_LOG_INFO("command: %s", (uint8_t)(&com_buf[0]));
        NRF_LOG_INFO("command: %s", p_evt->params.rx_data.p_data);

        uint16_t reslength;
        long temp_year;
        long temp_month;
        long temp_day;
        long temp_hours;
        long temp_minutes;
        long temp_seconds;
        long max_temp_days;

        for (i = 0; i < Number_of_command; i++)
        {
            if((strncmp(com_buf, NusCommand[i], 3)) == 0)
            {
                switch (i)
                {
                    case 0:   // 0: sta
                        if (State_keeper == STATE_PAIRING)
                        {
                            err_code = app_timer_start(m_data_record_timer_id, DATA_RECORD_MEAS_INTERVAL, NULL);
                            APP_ERROR_CHECK(err_code);
                            NRF_LOG_INFO("10 second measure and 10 minutes record start");
                            Meas10sec = 0;
                            Count_index_data_hr_hr = 0;
                            State_keeper = STATE_MEASURING;
                            NRF_LOG_INFO("State_keeper: %d", State_keeper);
                            reslength = 3;
                            err_code = ble_nus_data_send(&m_nus, "ack", &reslength, m_conn_handle);
                        }
                        else
                        {
                            NRF_LOG_INFO("already record started");
                            reslength = 3;
                            err_code = ble_nus_data_send(&m_nus, "nak", &reslength, m_conn_handle);                            
                        }
                        break;
                    case 1:   // 1: sto
                        err_code = app_timer_stop(m_data_record_timer_id);
                        APP_ERROR_CHECK(err_code);
                        NRF_LOG_INFO("10 second measure and 10 minutes record stop");
                        if (State_keeper == STATE_MEASURING)
                        {
                            State_keeper = STATE_PAIRING;
                            NRF_LOG_INFO("State_keeper: %d", State_keeper);
                            reslength = 3;
                            err_code = ble_nus_data_send(&m_nus, "ack", &reslength, m_conn_handle);
                        }
                        else
                        {
                            reslength = 3;
                            err_code = ble_nus_data_send(&m_nus, "nak", &reslength, m_conn_handle);
                        }
                        break;
                    case 2:   // 2: rqs
                        sprintf(resdatanum, "%03d", Count_index_data_hr_hr);
                        reslength = 3;
                        err_code = ble_nus_data_send(&m_nus, resdatanum, &reslength, m_conn_handle);
                        break;
                    case 3:   // 3: rqd
                        if (Count_index_data_hr_hr > 0)
                        {
                            err_code = app_timer_start(m_data_output_timer_id, DATA_OUTPUT_INTERVAL, NULL);
                            APP_ERROR_CHECK(err_code);
                            NRF_LOG_INFO("data output start");
                            reslength = 3;
                            err_code = ble_nus_data_send(&m_nus, "ack", &reslength, m_conn_handle);
                        }
                        else
                        {
                            NRF_LOG_INFO("data output not start, none data");
                            reslength = 3;
                            err_code = ble_nus_data_send(&m_nus, "nak", &reslength, m_conn_handle);
                        }
                        break;
                    case 4:   // 4: scd
                        /* Ex. "scd 2018-01-03" */
                        temp_year =  strtol((const char *)(&com_buf[4]), NULL, 10);
                        temp_month = strtol((const char *)(&com_buf[9]), NULL, 10);
                        temp_day =  strtol((const char *)(&com_buf[12]), NULL, 10);
                        
                        max_temp_days = month_days[temp_month];
                        if (temp_month == 2)
                        {
                            if ((temp_year % 4 == 0 && temp_year % 100 != 0) || (temp_year % 400 == 0)) //leap year
                            {
                                max_temp_days = max_temp_days + 1;
                            }
                        }

