takurx/nRF5_test_ble_app_nus_and_hts_and_hrs_with_saadc_twi-bh1792glc/examples/ble_peripheral/ble_app_uart/main.c
    //err_code = pm_sec_params_set(&sec_param);
    //APP_ERROR_CHECK(err_code);

    //err_code = pm_register(pm_evt_handler);
    //APP_ERROR_CHECK(err_code);
}






void saadc_timer_handler(nrf_timer_event_t event_type, void * p_context)
{

}

void saadc_sampling_event_init(void)
{
    ret_code_t err_code;

    err_code = nrf_drv_ppi_init();
    APP_ERROR_CHECK(err_code);

    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    timer_cfg.bit_width = NRF_TIMER_BIT_WIDTH_32;
    err_code = nrf_drv_timer_init(&m_timer, &timer_cfg, saadc_timer_handler);
    APP_ERROR_CHECK(err_code);

    /* setup m_timer for compare event every 1000ms */
    uint32_t ticks = nrf_drv_timer_ms_to_ticks(&m_timer, 1000);
    nrf_drv_timer_extended_compare(&m_timer,
                                   NRF_TIMER_CC_CHANNEL0,
                                   //NRF_TIMER_CC_CHANNEL1,
                                   ticks,
                                   NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK,
                                   false);
    nrf_drv_timer_enable(&m_timer);

    uint32_t timer_compare_event_addr = nrf_drv_timer_compare_event_address_get(&m_timer,
                                                                                NRF_TIMER_CC_CHANNEL0);
                                                                                //NRF_TIMER_CC_CHANNEL1);
    uint32_t saadc_sample_task_addr   = nrf_drv_saadc_sample_task_get();

    /* setup ppi channel so that timer compare event is triggering sample task in SAADC */
    err_code = nrf_drv_ppi_channel_alloc(&m_ppi_channel);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_ppi_channel_assign(m_ppi_channel,
                                          timer_compare_event_addr,
                                          saadc_sample_task_addr);
    APP_ERROR_CHECK(err_code);
}



static uint8_t  m_adc_channel_enabled; 
static nrf_saadc_channel_config_t  channel_0_config = NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN0);    //NRF_SAADC_INPUT_AIN0: P0.02, body temprature
static nrf_saadc_channel_config_t  channel_1_config = NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN1);    //NRF_SAADC_INPUT_AIN1: P0.03, battery temprature
static nrf_saadc_channel_config_t  channel_5_config = NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN5);    //NRF_SAADC_INPUT_AIN5: P0.29, battery voltage

void saadc_callback(nrf_drv_saadc_evt_t const * p_event)
{
    int ad_val;
    //float resolution = 1024.0; //1024 = 2^10, please check ad bit setting
    float resolution = 16384.0; //16384 = 2^14, please check ad bit setting
    float ad_voltage;
    float ad_resistance;
    float ad_resistance1;
    float vcc = 2.70;   // adc max 2.70v? vcc:3.00v
    //float resistance0 = 10000;   // R0, termista, 10k ohm (normal, 25deg) 
    float resistance0 = 6706.7;   // R0, termista, 10k ohm (normal, 36deg)
    float resistance1 = 6800.0;   // R1, split voltage resitance, 6.8k ohm
    float e = 2.7182818284; // Napier's constant
    float b = 3380.0; // B parameter termista value when 25 deg. = 3380
    //float standard_temp = 298.15;  // 25.0 deg + 273.15 absolute temp. [kelbin]
    float standard_temp = 309.15;  // 36.0 deg + 273.15 absolute temp. [kelbin]
    float temperature;
    float correction_term = 1292;
    float bat_voltage;
    float bat_percent;

    //maybe need nrf_log_flush()
    if (p_event->type == NRF_DRV_SAADC_EVT_DONE)
    {
        static ret_code_t err_code;

        if (m_adc_channel_enabled == 0)   //NRF_SAADC_INPUT_AIN0: P0.02, body temprature
        {
            err_code = nrf_drv_saadc_channel_uninit(0);
            APP_ERROR_CHECK(err_code);
            err_code = nrf_drv_saadc_channel_init(1, &channel_1_config);
            APP_ERROR_CHECK(err_code);

            err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer, SAMPLES_IN_BUFFER);
            APP_ERROR_CHECK(err_code);

            if(Debug_output_body_temperature == true)
            {
                NRF_LOG_INFO("Channel %d value: %d", m_adc_channel_enabled, p_event->data.done.p_buffer[0]);
            }

            ad_val = (int)p_event->data.done.p_buffer[0];
            ad_voltage = (float)(ad_val + correction_term) / resolution * vcc;
            ad_resistance = (resistance1 * ad_voltage) / (vcc - ad_voltage);
            temperature = b/(logf(ad_resistance/resistance0) + (b/standard_temp)) - 273.15;
            
            if(Debug_output_body_temperature == true)
            {
                NRF_LOG_RAW_INFO("%d," NRF_LOG_FLOAT_MARKER ",", ad_val, NRF_LOG_FLOAT(temperature));
                NRF_LOG_RAW_INFO(NRF_LOG_FLOAT_MARKER "\n", NRF_LOG_FLOAT(ad_voltage));
            }
            Body_temperature = temperature;

            m_adc_channel_enabled = 1;
        }
        else if (m_adc_channel_enabled == 1)    //NRF_SAADC_INPUT_AIN1: P0.03, battery temprature
        {
            err_code = nrf_drv_saadc_channel_uninit(1);
            APP_ERROR_CHECK(err_code);
            err_code = nrf_drv_saadc_channel_init(5, &channel_5_config);
            APP_ERROR_CHECK(err_code);

            err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer, SAMPLES_IN_BUFFER);
            APP_ERROR_CHECK(err_code);
            
            if(Debug_output_battery_temperature == true)
            {
                NRF_LOG_INFO("Channel %d value: %d", m_adc_channel_enabled, p_event->data.done.p_buffer[0]);
            }

            ad_val = (int)p_event->data.done.p_buffer[0];
            ad_voltage = (float)(ad_val + correction_term) / resolution * vcc;
            ad_resistance = (resistance1 * ad_voltage) / (vcc - ad_voltage);
            temperature = b/(logf(ad_resistance/resistance0) + (b/standard_temp)) - 273.15;
            
            if(Debug_output_battery_temperature == true)
            {
                NRF_LOG_RAW_INFO("%d," NRF_LOG_FLOAT_MARKER ",", ad_val, NRF_LOG_FLOAT(temperature));
                NRF_LOG_RAW_INFO(NRF_LOG_FLOAT_MARKER "\n", NRF_LOG_FLOAT(ad_voltage));
            }
            Battery_temperature = temperature;

