takurx/nRF5_test_ble_app_nus_and_hts_and_hrs_with_saadc_twi-bh1792glc/examples/ble_peripheral/ble_app_uart/main.c
    while((!twi_tx_done) && --timeout);
    if(!timeout) return NRF_ERROR_TIMEOUT;
    twi_tx_done = false;

    err_code = nrf_drv_twi_rx(&m_twi, slv_adr, reg, reg_size);
    if(err_code != NRF_SUCCESS) return err_code;

    timeout = BH1792_TWI_TIMEOUT;
    while((!twi_rx_done) && --timeout);
    if(!timeout) return NRF_ERROR_TIMEOUT;
    twi_rx_done = false;

    //return rc;  //rc:0 is normal, rc:4 is error. but in nrf5 when case of error, already return
    return 0;
}

/*
void error_check(int32_t ret, String msg)
{
  if(ret < 0) {
    msg = "Error: " + msg;
    msg += " function";
    NRF_LOG_INFO("%s\n", msg);
    NRF_LOG_INFO("ret = ");
    NRF_LOG_INFO("%d", ret);
    if(ret == BH1792_I2C_ERR) {
      NRF_LOG_INFO("i2c_ret = ");
      NRF_LOG_INFO("%d\n", m_bh1792.i2c_err);
    }
    while(1);
  }
}
*/






/** @brief: Function for handling the RTC0 interrupts.
 * Triggered on TICK and COMPARE0 match.
 */
static volatile int Tick_count = 0;
static volatile int Reset_count = 0;
static void rtc_handler(nrf_drv_rtc_int_type_t int_type)
{
    if (int_type == NRF_DRV_RTC_INT_TICK)
    {
        if (Tick_count == 4 || Tick_count == 8)
        {
            m_xfer_done = true;
        }


        /*Blink/light up LED display state, State_keeper.
        // Blink GREEN: Advertising that Before Pairing, 0
        // GREEN: Pairing and Idle state, 1
        // RED: Measring state and Pairing, 2
        // Blink GREEN and RED: Emergency, 3
        // Blink RED: Measuring and Adverting, 4
        // BLUE: boot, reboot from sleep, 5
        // Blink BLUE: go to sleep, 6
        */
        if (LED_output_state)
        {
            switch (State_keeper)
            {
                case 0: //STATE_ADVERTISING:
                    // Blink GREEN: Advertising that Before Pairing, 0
                    if (Tick_count == 0)
                    {
                        nrf_drv_gpiote_out_set(LED_3_COLOR_RED_PIN);
                        nrf_drv_gpiote_out_clear(LED_3_COLOR_GREEN_PIN);
                        nrf_drv_gpiote_out_set(LED_3_COLOR_BLUE_PIN);
                        }
                    else
                    {
                        nrf_drv_gpiote_out_set(LED_3_COLOR_RED_PIN);
                        nrf_drv_gpiote_out_set(LED_3_COLOR_GREEN_PIN);
                        nrf_drv_gpiote_out_set(LED_3_COLOR_BLUE_PIN);               
                    }
                    break;
                case 1: //STATE_PAIRING:
                    // GREEN: Pairing and Idle state, 1
                    nrf_drv_gpiote_out_set(LED_3_COLOR_RED_PIN);
                    nrf_drv_gpiote_out_clear(LED_3_COLOR_GREEN_PIN);
                    nrf_drv_gpiote_out_set(LED_3_COLOR_BLUE_PIN);
                    break;
                case 2: //STATE_MEASURING (and STATE_PAIRING):
                    // RED: Measring state and Pairing, 2
                    nrf_drv_gpiote_out_clear(LED_3_COLOR_RED_PIN);
                    nrf_drv_gpiote_out_set(LED_3_COLOR_GREEN_PIN);
                    nrf_drv_gpiote_out_set(LED_3_COLOR_BLUE_PIN);
                    break;
                case 3: //STATE_EMERGENCY:
                    // Blink GREEN and RED: Emergency, 3
                    if (Tick_count % 2 == 0)
                    {
                        nrf_drv_gpiote_out_set(LED_3_COLOR_RED_PIN);
                        nrf_drv_gpiote_out_clear(LED_3_COLOR_GREEN_PIN);
                        nrf_drv_gpiote_out_set(LED_3_COLOR_BLUE_PIN);
                    }
                    else
                    {
                        nrf_drv_gpiote_out_clear(LED_3_COLOR_RED_PIN);
                        nrf_drv_gpiote_out_set(LED_3_COLOR_GREEN_PIN);
                        nrf_drv_gpiote_out_set(LED_3_COLOR_BLUE_PIN);
                    }
                    break;
                case 4: //STATE_
                    // Blink RED: Measuring and Adverting, 4
                    if (Tick_count == 0)
                    {
                        nrf_drv_gpiote_out_clear(LED_3_COLOR_RED_PIN);
                        nrf_drv_gpiote_out_set(LED_3_COLOR_GREEN_PIN);
                        nrf_drv_gpiote_out_set(LED_3_COLOR_BLUE_PIN);
                        }
                    else
                    {
                        nrf_drv_gpiote_out_set(LED_3_COLOR_RED_PIN);
                        nrf_drv_gpiote_out_set(LED_3_COLOR_GREEN_PIN);
                        nrf_drv_gpiote_out_set(LED_3_COLOR_BLUE_PIN);               
                    }
                    break;
                case 5:
                    // BLUE: boot, reboot from sleep, 5
                    nrf_drv_gpiote_out_set(LED_3_COLOR_RED_PIN);
                    nrf_drv_gpiote_out_set(LED_3_COLOR_GREEN_PIN);
                    nrf_drv_gpiote_out_clear(LED_3_COLOR_BLUE_PIN);
                    break;
                case 6:
                    // Blink BLUE: go to sleep, 6
                    nrf_drv_gpiote_out_set(LED_3_COLOR_RED_PIN);
                    nrf_drv_gpiote_out_set(LED_3_COLOR_GREEN_PIN);
                    nrf_drv_gpiote_out_toggle(LED_3_COLOR_BLUE_PIN);
                    break;
                default:
                    nrf_drv_gpiote_out_set(LED_3_COLOR_RED_PIN);
                    nrf_drv_gpiote_out_set(LED_3_COLOR_GREEN_PIN);
                    nrf_drv_gpiote_out_set(LED_3_COLOR_BLUE_PIN);
            }
        }
        else
        {
            if (State_keeper == STATE_SLEEPING)
            {
                // Blink BLUE: go to sleep, 6
                nrf_drv_gpiote_out_set(LED_3_COLOR_RED_PIN);
                nrf_drv_gpiote_out_set(LED_3_COLOR_GREEN_PIN);
                nrf_drv_gpiote_out_toggle(LED_3_COLOR_BLUE_PIN);
            }
            else
            {
                nrf_drv_gpiote_out_set(LED_3_COLOR_RED_PIN);
                nrf_drv_gpiote_out_set(LED_3_COLOR_GREEN_PIN);
                nrf_drv_gpiote_out_set(LED_3_COLOR_BLUE_PIN);
            }
        }

        if (nrf_gpio_pin_read(SWITCH1_PIN))
        {
            //NRF_LOG_INFO("swith1 true");
            Reset_count = 0;
        }
        else
        {
            //NRF_LOG_INFO("switch1 false");
            Reset_count++;
            if (Reset_count > 24)
            {
                //3s long push and software reset
                /*
                NRF_LOG_INFO("software reset");
                NRF_LOG_FLUSH();
                
                ret_code_t err_code;
                err_code = sd_nvic_SystemReset();
                APP_ERROR_CHECK(err_code);
                */

